{
    "PetuniaT1" :
    {
        "Text" : "Those blasted beavers happened that's what!\" Petunia crossed her arms boldly. \"Ever since they built that damn dam there has been very little water flowing down the river, I do not have enough to give to my flowers. I'm an old lady, I can't be going everyday uphill just for my plants.",
        "ParentInteractableName" : "petunia",
        "IsActive" : true,
        "ActivatesAfterFinish": ["PetuniaQ3"]
    },

    "PetuniaT2" :
    {
        "Text" : "Not as long as those blasted beavers are around!\" Petunia crossed her arms boldly. \"Ever since they built that damn dam there has been very little water flowing down the river, I do not have enough to give to my flowers. I'm an old lady, I can't be going everyday uphill just for my plants.",

        "ParentInteractableName" : "petunia",
        "IsActive" : true,
        "ActivatesAfterFinish": ["PetuniaQ3"]
    },
    "PetuniaT3":
    {
        "Text" : "Excuse you?! You better watch your tone mister!\" Petunia chastised. \"It's not my fault those dumb beavers came!\" Petunia crossed her arms boldly. \"Ever since they built that damn dam there has been very little water flowing down the river, I do not have enough to give to my flowers. I'm an old lady, I can't be going everyday uphill just for my plants.\"",

        "IsActive": true,
        "ParentInteractableName" : "petunia",
        "ChangeInResources": {"Social": -5},
        "ActivatesAfterFinish": ["PetuniaQ3"]
    },

    "PetuniaT4":
    {
        "Text": "Then be on your way!\" Petunia scowled as she seemed ready to chase you out. Man this lady doesn't take rejection well.",

        "IsActive": true,
        "ParentInteractableName" : "petunia",
        "ChangeInResources": {"Social": -5, "Environment": 10}
        
    },

    "PetuniaT5-PH":
    {
        "Text": "Quest Accepted. Now, you need to go to the River Shore and destroy the beaver dam",
        "IsActive": true,
        "ParentInteractableName" : "petunia",
        "ActivatesAfterFinish": ["DamDefault", "PetuniaQ5"]
    },

    "PetuniaReward":
    {
        "Text": "Petunia beamed 'Wonderful! To be honest I'm not even sure why I asked, I can see the river flowing nicely. This will make my garden flourish once more!' she exclaimed. Don't think I forgot about our deal, as promised I will dedicate this opportunity to make sure others have some food on their plate.' She reassured you, well at least some good came out of this. Though truthfully you'd rather forget what you had to do get here...",
        "IsActive": true,
        "ParentInteractableName" : "petunia",
        "ChangeInResources": {"Social": 10, "Environment": 3}
        
    },
    "PetuniaAngry":
    {
        "Text": "How dare you! Get out of here, I don't want to see your face again! Petunia scowled as she seemed ready to chase you out. Man this lady doesn't take rejection well...",
        "IsActive": false,
        "ParentInteractable" : "petunia",
        "ChangeInResources":  {"Social": -5}
    
    },
    "PetuniaWaiting":
    {
        "Text" : "She sighed heavily 'Get back to me when it's over.'",
        "IsActive" : false,
        "ParentInteractable" : "petunia"
    },

    "DestroyDam":{
        "Text": "With unwavering determination you began swinging the bat over and over, cries of the wildlife filled your ears as the dam eventually gave out and water seeped through unobstructed.\n   At least Petunia will be happy...",
        "ParentInteractableName" : "dam",
        "ActivatesAfterFinish": ["PetuniaAskAboutDam"],
        "ChangeInResources": {"Environment": -10},
        "Helper" : {"DescriptionChanges" : {"river-shore" : "You see a beautiful flowing river..."}}

    },

    "LeaveDam":{
        "Text": "What were you thinking? Only a monster could do something like this. Breathing a sigh of relief you began thinking about how you could explain this to Petunia later...",
        "ParentInteractable": "dam",
        "ActivatesAfterFinish": ["PetuniaAngry"],
        "ChangeInResources": {"Environment": 15}
    },

    "MerchantT1":
    {
        "Text" : "Not another one...\nthe merchant sighs and forces a smile,\n\"Sorry but the manager isn't available at the moment, let me see what I can do for you...\"\n",
        "ParentInteractable" : "merchant",
        "ActivatesAfterFinish" : ["MerchantQ3"],
        "ChangeInResources" : {"Social" : -5}
    },

    "MerchantT2":
    {
        "Text": "I understand... Anyways there's nothing I can do about the price so if there's nothing else I will have to ask you to leave.\" He exclaimed politely, you don't think there's anything else of note here.",
        "ParentInteractable" : "merchant",
        "IsActive": false,
        "ChangeInResources" : {"Money" : -5, "Environment" : -4}
    },

    "MerchantT3":
    {
        "Text": "\"Oh thank you! [Boss] is in the back, talk to him when you're ready!\", he beamed.\nSeems like you need to prepare for a negotiation.",
        "ParentInteractable" : "merchant",
        "IsActive": true,
        "ActivatesAfterFinish" : ["MerchantQ5", "BossQ1"],
        "Helper": {"ChangeInteractables" : {"boss" : true, "merchant" : true}}
    },

    "MerchantT4":
    {
        "Text": "'Okay, talk to me when you're done' He returns to his duties.",
        "IsActive" : false
    },

    "BossT1":
    {
        "Text": " QUEST FAILED TODO 'How dare you?! Get out of here right this instance!' Uh oh, he did not seem happy with that.'",
        "IsActive": true
    },

    "BossT2":
    {
        "Text": " QUEST FAILED TODO'And you're done, get out of my office before I call security.' Uh oh, seems like he didn't appreciate the outburst.",
        "IsActive": true
    },

    "BossFail":
    {
        "Text": "'I said I would hear you out, I can see now that it was a mistake. Leave my office.' \n Seems like that's it...",
        "IsActive": true
    },

    "BossT3":
    {
        "Text": "\"Pleasure doing business with you!\"\nYou can't help but think about how much of a greedy bastard this guy is, but at least it's done with...",
        "IsActive": true,
        "ChangeInResources" : {"Money" : -20}
    },

    "BossT4":
    {
        "Text": "Then I will have to ask you to leave, I am sorry that we could not come to an agreement.\nYou tried your best, nothing else you can do.",
        "IsActive": true
    },

    "BossAllCorrect":
    {
        "Text": "'Alright, alright! I see your point, I will do what I can.'\nBoss agreed to your proposal, you walk out of there with a rightfully deserved grin on your face.\nYou want to go back and talk to the [Merchant] again",
        "IsActive": true,
        "ActivatesAfterFinish": ["MerchantQ6"]
    },

    "BossEventComplete":
    {
        "Text": "'HE DID!', he merchant yelled in surprise.\nThat's fantastic news! Thank you so much!\nHere have this, it's not a lot but I want to show you my thanks!",
        "IsActive": true,
        "ChangeInResources": {"Environment": 5, "Money":20 , "Social": 9}
    },

    "BernardCrowd":
    {
        "Text": "Our 2 lumberjacks got injured. People try to help as they can but most just stand around and worry. I would love to get the issue resolved. For more details go ask them.",
        "ParentInteractable" : "captain-bernard",
        "ActivatesAfterFinish" : ["BernardQ1-afterCrowd"]
    },
    "BernardT1":
    {
        "Text" : "Well, I would appreciate my people getting back to work, go ask them what they need.\nWe would like to disassemble the ruins to the west and use the materials to build some shelters and a dam. However we lack the equipment, we have a great offer but we don't have any money left. If you would help us, we could give you some of our resources.",
        "ParentInteractable" : "captain-bernard",
        "ActivatesAfterFinish" : ["GalavaQuest", "BernardT1", "BernardQ1"]
    },
    "BernardT1-afterCrowd":
    {
        "Text" : "Well, I would appreciate my people getting back to work, go ask them what they need.\nWe would like to disassemble the ruins to the west and use the materials to build some shelters and a dam. However we lack the equipment, we have a great offer but we don't have any money left. If you would help us, we could give you some of our resources.",
        "ParentInteractable" : "captain-bernard",
        "ActivatesAfterFinish" : ["GalavaQuest", "BernardT1-afterCrowd", "BernardQ1-afterCrowd"]
    }
    

}

